<?php 

	/*
	
	8. Дан массив с элементами 1, 2, 3, 4, 5, 6, 7, 8, 9. С помощью цикла foreach создайте строку '­1­2­3­4­5­6­7­8­9­'. Циклы while и for

	*/

	$arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
	$str = '-';
	foreach ($arr as $v) {
		$str .= $v . '-';
	}
	echo $str . '<br>';
// -----------------------------------------------------
	$str = '-';
	for ($i=0, $len = count($arr);  $i < $len; $i++) { 
		$str .= $arr[$i] . '-';
	}
	echo $str . '<br>';
// -----------------------------------------------------
	$str = '-';
	$i = 0;
	$len = count($arr);
	while ($i < $len) {
		$str .= $arr[$i] . '-';
		$i++;
	}
	echo $str . '<br>';


?>